app/controllers/smiles_controller.rb

INSERT INTO "smiles" ("space", "title", "story", "happiness_level", "like_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["space", "yoloswag"], ["title", "ze"], ["story", "coon"], ["happiness_level", 1], ["like_count", 0], ["created_at", "2015-10-02 08:40:17.751766"], ["updated_at", "2015-10-02 08:40:17.751766"]]
---
  def new
  	@smile = Smile.new(:space => params[:space], :title => params[:title], :story => params[:story], :happiness_level => params[:happiness_level], :like_count => 0)
  	if @smile.save

SELECT  "smiles".* FROM "smiles" WHERE "smiles"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "smiles" SET "like_count" = ?, "updated_at" = ? WHERE "smiles"."id" = ?  [["like_count", 1], ["updated_at", "2015-10-02 10:51:19.792825"], ["id", 2]]
---
  def like
  	@smile = Smile.find(params[:id])
  	@smile.like_count = @smile.like_count + 1
  	if @smile.save

DELETE FROM "smiles" WHERE "smiles"."space" = ?  [["space", "yoloswag"]]
---
  def remove
  	if Smile.where(:space => params[:space]).delete_all